#include "kfs_detection_nav/kfs_manager.hpp"


const std::array<KfsManager::StairBoundary, 12> KfsManager::STAIR_BOUNDARIES = {{

    //台阶的（x_min, x_max, y_min, y_max, z_min, z_max, stair_id, stair_name） 
  
    // ===== 台深绿台阶（区域1-4）=====
    {-6.034398, -4.534398, -5.782118, -4.782118, 0.0, 0.4, 1, "Stair_Deep_Green_1"},
    {-4.534398, -3.034398, -5.782118, -4.782118, 0.0, 0.4, 2, "Stair_Deep_Green_2"},
    {-3.034398, -1.534398, -5.782118, -4.782118, 0.0, 0.4, 3, "Stair_Deep_Green_3"},
    {-1.534398,  0.0,      -5.782118, -4.782118, 0.0, 0.4, 4, "Stair_Deep_Green_4"},

    // ===== 台浅绿台阶（区域5-8）=====
    {-6.034398, -4.534398, -5.282118, -4.282118, 0.0, 0.4, 5, "Stair_Light_Green_5"},
    {-4.534398, -3.034398, -5.282118, -4.282118, 0.0, 0.4, 6, "Stair_Light_Green_6"},
    {-3.034398, -1.534398, -5.282118, -4.282118, 0.0, 0.4, 7, "Stair_Light_Green_7"},
    {-1.534398,  0.0,      -5.282118, -4.282118, 0.0, 0.4, 8, "Stair_Light_Green_8"},

    // ===== 台浅黄台阶（区域9-12）=====
    {-6.034398, -4.534398, -3.582118, -3.282118, 0.0, 0.4, 9,  "Stair_Light_Yellow_9"},
    {-4.534398, -3.034398, -3.582118, -3.282118, 0.0, 0.4, 10, "Stair_Light_Yellow_10"},
    {-3.034398, -1.534398, -3.582118, -3.282118, 0.0, 0.4, 11, "Stair_Light_Yellow_11"},
    {-1.534398,  0.0,      -3.582118, -3.282118, 0.0, 0.4, 12, "Stair_Light_Yellow_12"},
}};

  // namespace kfs_detection_nav
